Revit 2027 API
PanelScheduleView.GetLoadClassificationDemandLoad Method
 Gets the Demand Load for given Load Classification
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetLoadClassificationDemandLoad(
	int nRow,
	int nCol
)
Public Function GetLoadClassificationDemandLoad (
	nRow As Integer,
	nCol As Integer
) As String
public:
String^ GetLoadClassificationDemandLoad(
	int nRow,
	int nCol
)
member GetLoadClassificationDemandLoad :
        nRow : int *
        nCol : int -> string
Parameters
nRow Int32
 Row number of Load Summary Section
nCol Int32
 Column number of Load Summary Section
Return Value
String
 The Demand Load for the Load Classification
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The given row number nRow is invalid in Summary. -or- The given column number nCol is invalid in Summary.
See Also
Reference
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace